
* SFS.py

#+begin_src python :results output
  import pandas as pd
  from sklearn.linear_model import LogisticRegression
  from mlxtend.feature_selection import SequentialFeatureSelector as SFS
  from mlxtend.plotting import plot_sequential_feature_selection as plot_sfs
  import matplotlib.pyplot as plt
  from sklearn.preprocessing import StandardScaler
  from sklearn.feature_selection import RFE

  # https://archive.ics.uci.edu/ml/datasets/Estimation+of+obesity+levels+based+on+eating+habits+and+physical+condition+

  #Load the data
  obesity = pd.read_csv("obesity.csv")

  #Inspect the data
  print(obesity.head())

  #Split the data into X and y
  X = obesity.drop(['NObeyesdad'], axis=1)
  y = obesity['NObeyesdad']

  #Create a logistic regression model called lr
  lr = LogisticRegression(max_iter=1000)

  #Fit the model
  lr.fit(X, y)

  #Compute and print the accuracy
  print(lr.score(X, y))

  #Set up SFS parameters
  sfs = SFS(lr,
            k_features=9,
            forward=True,
            floating=False,
            scoring='accuracy',
            cv=0)

  #Fit the model
  sfs.fit(X, y)

  #Print sfs.subsets_
  #print(sfs.subsets_)

  #Print(sfs.subsets_[9])
  print(sfs.subsets_[9])

  #Print a tuple of feature names after 9 features are added
  print(sfs.subsets_[9]['feature_names'])
  print(sfs.subsets_[9]['avg_score'])

  #Plot the accuracy of the model as a function of the number of features
  plot_sfs(sfs.get_metric_dict())
  plt.show()

#+end_src

#+RESULTS:
: /home/oldoc/OpenAI/lib/python3.12/site-packages/numpy/core/_methods.py:206: RuntimeWarning: Degrees of freedom <= 0 for slice
:   ret = _var(a, axis=axis, dtype=dtype, out=out, ddof=ddof,
: /home/oldoc/OpenAI/lib/python3.12/site-packages/numpy/core/_methods.py:198: RuntimeWarning: invalid value encountered in scalar divide
:   ret = ret.dtype.type(ret / rcount)
: [ Babel evaluation exited with code 0 ]

* SBS.py

#+begin_src python :results output
  import pandas as pd
  from sklearn.linear_model import LogisticRegression
  from mlxtend.feature_selection import SequentialFeatureSelector as SFS
  from mlxtend.plotting import plot_sequential_feature_selection as plot_sfs
  import matplotlib.pyplot as plt
  from sklearn.preprocessing import StandardScaler
  from sklearn.feature_selection import RFE

  # https://archive.ics.uci.edu/ml/datasets/Estimation+of+obesity+levels+based+on+eating+habits+and+physical+condition+

  #Load the data
  obesity = pd.read_csv("obesity.csv")

  #Inspect the data
  print(obesity.head())

  #Split the data into X and y
  X = obesity.drop(['NObeyesdad'], axis=1)
  y = obesity['NObeyesdad']

  #Create a logistic regression model called lr
  lr = LogisticRegression(max_iter=1000)

  #Fit the model
  lr.fit(X, y)

  #Compute and print the accuracy
  print(lr.score(X, y))

  ##Sequential Backward Selection
  sbs = SFS(lr,
            k_features=3,
            forward=False,
            floating=False,
            scoring='accuracy',
            cv=0)

  #Fit sbs to X and y
  sbs.fit(X, y)

  #Print(sfs.subsets_[9])
  print(sbs.subsets_[7])

  #Print a tuple of feature names after 9 features are added
  print(sbs.subsets_[9]['feature_names'])
  print(sbs.subsets_[9]['avg_score'])

  #Plot the accuracy of the model as a function of the number of features
  plot_sfs(sbs.get_metric_dict())
  plt.show()

#+end_src

#+RESULTS:
: /home/oldoc/OpenAI/lib/python3.12/site-packages/numpy/core/_methods.py:206: RuntimeWarning: Degrees of freedom <= 0 for slice
:   ret = _var(a, axis=axis, dtype=dtype, out=out, ddof=ddof,
: /home/oldoc/OpenAI/lib/python3.12/site-packages/numpy/core/_methods.py:198: RuntimeWarning: invalid value encountered in scalar divide
:   ret = ret.dtype.type(ret / rcount)
: [ Babel evaluation exited with code 0 ]

* RFE.py

#+begin_src python :results output
  import pandas as pd
  import numpy as np
  from sklearn.linear_model import LogisticRegression
  from sklearn.feature_selection import RFE
  from sklearn.preprocessing import StandardScaler

  # https://archive.ics.uci.edu/ml/datasets/Estimation+of+obesity+levels+based+on+eating+habits+and+physical+condition+

  #Load the data
  obesity = pd.read_csv("obesity.csv")

  #Inspect the data
  print(obesity.head())

  #Split the data into X and y
  X = obesity.drop(['NObeyesdad'], axis=1)
  y = obesity['NObeyesdad']

  #Because you'll need to be able to acces feature names
  features = X.columns

  #Standardize the data
  X = StandardScaler().fit_transform(X)

  #Logistic Regression model
  lr = LogisticRegression(max_iter=1000)

  #Create a RFE() object that selects 8 features
  rfe = RFE(lr, n_features_to_select=8)
  rfe.fit(X, y)

  #Inspect chosen features
  rfe_features = [f for (f, support) in zip(features, rfe.support_) if support]

  print(rfe_features)

  #Print the accuracy of the model with features chosen by recursive feature elimination
  print('RFE score: ', rfe.score(X, y))

#+end_src

#+RESULTS:
#+begin_example
   Gender   Age  ...  Walking  NObeyesdad
0       0  21.0  ...        0           0
1       0  21.0  ...        0           0
2       1  23.0  ...        0           0
3       1  27.0  ...        1           0
4       1  22.0  ...        0           0

[5 rows x 19 columns]
['Age', 'family_history_with_overweight', 'FAVC', 'FCVC', 'CAEC', 'SCC', 'Automobile', 'Walking']
RFE score:  0.7678825201326386
#+end_example
